// 例举account_urls 可能没包含的相应的game攻略，不会分类
const allGameList = [
    // 其他
    "coser本人", "coser同行", "游戏综合",

    // 米哈游
    "崩坏星穹铁道", "绝区零", "原神","少女前线2","无期迷途",
    // 网易
    "永劫无间手游", "永劫无间", "漫威争锋", "鸣潮", "明日方舟", "蛋仔派对", "第五人格",
    // 腾讯
    "界外狂潮", "新月同行", "英雄联盟", "王者荣耀", "逆水寒手游", "逆水寒", "DNF", "航海王壮志雄心",
    "光遇", "燕云十六声", "心动小镇", "阴阳师", "火影忍者", "金铲铲之战",
    "以闪亮之名", "归龙潮",
    "宝可梦大集结",
    "碧蓝档案",
    "诛仙世界", "尘白禁区", "三角洲行动", "暗区", "恋与深空", "荒野乱斗", "星际战甲1999", "CF",
    "和平精英",
    "剑网3", "物华弥新",
    "战双帕弥什", "使命召唤手游", "幻塔", "穿越火线", "一梦江湖", "恋与制作人",
    // 其它厂商
    "碧蓝航线", "无限暖暖", "闪耀暖暖", "无尽梦回", "天龙八部", "重返未来1999", "崩坏3", "无畏契约", "魔兽世界",    
]

module.exports = {
    allGameList
}   